anims = """
12345
Не ешь сырую свинину
4 серии
12345
Мой телохранитель
5 серий
12345
100 девушек, которые ну очень сильно тебя любят
3 серии
12345
Опытная ты и неопытный я
4 серии
12345
Нежить и Неудача
4 серии
12345
Фермерская жизнь в ином мире
12 серий
12345
Мастера меча онлайн: альтернатива
12 серий
12345
Парад смерти
12 серий
12345
Хроники Акаши
12 серий
12345
Этот чудесный мир
12 серий
12345
Я переродился торговым автоматом в лабиринте
12 серий
12345
Моя возлюбленная забыла свои очки
13 серий
12345
Несносные пришельцы
23 серии
12345
Тяжкий труд в подземелье
12 серий
12345
Ниа: Отомата
12 серий
12345
Дочь моей мачехи - моя бывшая девушка
12 серий
12345
Этот прекрасный мир одаренный взрывами
12 серий
12345
Радиосигнал от чудачки. Юноша на связи
13 серий
12345
Моя любовь 999 уровня к Ямаде
13 серий
12345
Магия и мускулы
12 серий
12345
Патриотизм Мориарти
2 сезона
24 серии
12345
Одинокий рокер!
12 серий
12345
Семь смертных грехов
5 сезонов
99 серий
2 фильма
12345
Моб Психо 100
3 сезона
37 серий
12345
Кот, мастер на все лапки, сегодня снова грустит
13 серий
12345
Звёздное дитя
11 серий
12345
Евангелион
26 серий
1 фильм
12345
Девушка напрокат
3 сезона
36 серий
12345
Девочка, которая видит это
12 серий
12345
Ворона в гареме
13 серий
 
12345
Волчица и семеро друзей
12 серий
12345
Богатый детектив. Баланс: Неограничен
11 серий
12345
Бессонница после школы
13 серий
12345
Бездельные дни старшеклассницы
12 серий
12345
Адский рай
13 серий
12345
Летнее время
25 серий
12345
Унеси меня на Луну
2 сезона
27 серий
12345
Золотая пора
24 серии
12345
Так сложно любить отаку
14 серий
12345
Хьёка
22 серии
12345
Бедствие ли это?
12 серий
12345
Ангел по соседству
12 серий
12345
Она представилась как ученик мудреца
12 серий
12345
Мой братик больше не братик!
12 серий
12345
Ледяной парень и его классная коллега
12 серий
12345
Томо - девушка!
13 серий
12345
Ну не может моя сестрёнка быть такой милой
2 сезона
32 серии
12345
Человек-бензопила
12 серий
12345
Мастера меча онлайн
3 сезона
96 серий
3 фильма
12345
Когда плачут цикады
5 сезонов
116 серий
12345
У Коми проблемы с общением
2 сезона
24 серии
12345
Взрыв!
12 серий
12345
Моя девушка не только милая
12 серий
12345
Кошечка из Сакурасо
24 серии
12345
Туалетный мальчик Ханако
14 серий
12345
Дурни, тесты, аватары
2 сезона
26 серий
12345
Очень приятно - Бог
2 сезона
31 серия
12345
Семья шпиона
2 сезона
29 серий
12345
Песнь ночных сов
13 серий
12345
Эта фарфоровая кукла влюбилась
12 серий
12345
Крутой учитель Онидзука
43 серии
12345
Не издевайся, Нагаторо
2 сезона
24 серии
12345
Хоримия
2 сезона
26 серий
12345
Любовь, выборы и шоколад
13 серий
12345
Сквозь бальный зал
24 серии
12345
ТораДора
25 серий
12345
Сатана на подработке!
2 сезона
37 серий
12345
Госпожа Кагуя: в любви как на войне
3 сезона
41 серия
12345
Ангельские ритмы!
14 серий
12345
Атака титанов
4 сезона
88 серий
2 фильма
12345
Нет игры - нет жизни
12 серий
1 фильм
12345
Пять невест
2 сезона
26 серий
1 фильм
12345
Я побрился. И приютил старшеклассницу
13 серий
12345
Розовая пора моей школьной жизни сплошной обман
3 сезона
40 серий
12345
Цикл историй
8 сезонов
87 серий
4 фильма
12345
Всегда вялый Танака-кун
12 серий
12345
Готика
24 серии
12345
Необъятный океан
12 серий
12345
Реинкарнация безработного
2 сезона
37 серий
12345
Эхо террора
11 серий
12345
Доктор Стоун
3 сезона
50 серий
12345
Волейбол!
4 сезона
85 серий
2 фильма
12345
Этот прекрасный мир
2 сезона
22 серии
1 фильм
12345
С нуля: Пособие по выживанию в альтернативном мире
2 сезона
50 серий
2 фильма
12345
Тетрадь смерти
37 серий
12345
Город, в котором меня нет
12 серий
12345
Бродяга Кэнсин
2 сезона
112 серий
1 фильм
12345
Этот глупый свин не понимает мечту девочки-зайки
13 серий
1 фильм
12345
Герцог смерти и его тёмная горничная
2 сезона
24 серии
12345
Ван Пис
1081 серия
14 фильмов
12345
Хантер х Хантер
148 серий
2 фильма
12345
Моя геройская академия
6 сезонов
138 серий
3 фильма
12345
Клинок, рассекающий демонов
4 сезона
55 серий
12345
Фейри Тейл
3 сезона
328 серий
2 фильма
12345
Бездомный Бог
2 сезона
25 серий
12345
Токийский Гуль
3 сезона
48 серий
12345
Ванпанчмен
2 сезона
24 серии
"""

for i in anims.split("\n"):
    if (len(i) > 0):
        if (i[0] not in map(str, range(0, 10))):
            print(i)
